
# - @HAHAHA_DECOD
#2025-05-26
#ZAXOTEL MADE

import os
import sys
try:
	import colorama
except Exception as ModuleNotFoundError:
	print("\n   Ошибка! Установите библиотеку colorama\n   Pydroid 3 — откройте терминал, напишите pip install colorama\n   Termux — напишите pip install colorama")
	sys.exit()
import time
def clear():
	os.system("clear")
clear()
intro = """
............................................................H
.............................:SS%**?*???+;:%?,..............A
............................*S;:+*****????#@%+;.............T
...........................;?+;*********S@@#%**;............S
..........................,;+**?********?@@#S?**:...........U
..........................;**?*%**??**?*?%@@#%**+...........N
..:%?,....................***S%*?*+?S??*??#@@%***:..........E
..+@@#*,..................?*S???%S?+S*S??+%@%?***+..........
...:?@@@?:................*?S?,::;*::+%?S*#?,*?***,.........O
.....;@@@@S+,.............;S#S.......:;S#S+..+?***:.........S
.....+?%#@@@#+,...........:###*:,;,.,,?S**;..;%***+.........I
.....,+?%@@#@S,...........;#SS#%:,:;;+*;;.;..;S****,........N
......:;:*S*+;............*SSSS?.,*%++;;*:...:S****:........T
......?%%S@+:.............?#SS%?;?%*;;::*%;,.,S****;........
......;?#@+.:::..........,?+::++##%***+*%+:::;%?****........B
........,::,.;%;,.......,:,..;;?#@+;::::*,,,.,:*****,.......Y
...........,:.;+#*,.....;:,:++?%S%::::::+......,?***:.......
............;*;;@@#;..,*##S??SS%#???***?;,...,,:****;.......D
............;@+*@@@@%+#@@@*+SS%%S*+;;::*;*;;;++*?***;.......E
............:S+#@@@@@@@@@@;+%??S?:::::::+?@@@@@S****+.......K
.............+?#@@@@@@@@%%;????S;::::::::+@@@@@S*****.......L
...............,:*S@@@S;:*+%??%?:::::::+.%@@@@@S*****.......E
...................:+:..;*%S??%*:::::;**;S@@@@@#*****,......M
.......................,*%#@%?%*:::;*%*;+#@@@@@#*****,......M
.......................;??@@@SS;:::*+;:::@@@@@@@*****,......
......................:*:*##@S*:;::::::,;@@@@@@@?***?:......I
....................,+%;:?#@@%:::::::::+S@@@@@@@S****:......|
...................,%@?;S@@@@#+::::;*%#@@@@@@@@@@****:......|
...................?@@%#@@@@@@*:;*S@@@@@@@@@@@@@@?***;......|
"""
workspace = """
db   db  .d8b.  d888888b .d8888. db    db d8b   db d88888b 
88   88 d8' `8b `~~88~~' 88'  YP 88    88 888o  88 88'     
88ooo88 88ooo88    88    `8bo.   88    88 88V8o 88 88ooooo 
88~~~88 88~~~88    88      `Y8b. 88    88 88 V8o88 88~~~~~ 
88   88 88   88    88    db   8D 88b  d88 88  V888 88.     
YP   YP YP   YP    YP    `8888Y' ~Y8888P' VP   V8P Y88888P
╔═══════════════════════════════════════════════╗
  [01] Поиск по бд в папке databases ~————~ .d8888.      
  [02] Поиск по облачному бд ~————————————~ 88'  YP 
  [03] Поиск по IP адресу ~———————————————~ 8bo.  
  [04] Поиск по Вконтакте ~———————————————~   Y8b.
  [05] Базовая информация о номере ~——————~ db   8D 
  [06] Отправить анонимное письмо ~———————~ `8888Y'earch
╚═══════════════════════════════════════════════╝
  ╔═════════════╗╔═════════════╗╔═════════════╗
    [55] Помощь      [77] Настройки     [99] Rewresh 
    [66] Chat GPT    [88] О софте       [00] Выход
  ╚═════════════╝╚═════════════╝╚═════════════╝"""
setbat = 1
print (Fore.BLUE + Style.BRIGHT + intro + "..................¡@@@@@"+ Fore.GREEN+ "...Press Enter..." + Fore.BLUE + "@@@@@@@@?***;......I")
def open_file(filename):
    try:
        os.system(f'python script/{filename}.py')
    except Exception as e:
        print(Fore.RED + f"Ошибка при открытии файла: {e}" + Fore.WHITE)
while True:
	prent = input(Style.BRIGHT+Fore.BLUE+" ~~~> ")
	if prent == "":
		clear()
		print(workspace)
		while True:
			choice = input(Style.BRIGHT+Fore.BLUE+" ~~~> ")
			if choice == "99":
				clear()
				print(Style.BRIGHT + Fore.BLUE + workspace)
				time.sleep(0.001)
				clear()
				print(Style.BRIGHT + Fore.BLUE + workspace)
			if choice == "00":
				print("   Выходим...")
				sys.exit()
			if choice == "88":
				print("   Софт создан в ознакомительных целях, разработчик не несет \n   ответвенности за ваши действия.\n\n   Не используйте функцию [06] для сваттинга, софт не\n   предоставляет  анонимности.\n\n   Софт бесплатный и не имеет возможности продажи.\n   (Кто попробует продать тому пизда)\n\n   Некоторые функции были нагло спизжены из других \n   бесплатных софтов.")
				print("\n   Создатель софта — Deklemm" + Fore.GREEN  + "\n   https://t.me/SmerteInaya"+ Fore.BLUE +"\n   Телеграмм канал" + Fore.GREEN + "\n   https://t.me/+i23G-mvo_Vs2YmQy " + Fore.BLUE + "\n   На Pytroid 3 ссылки кликабельны.")
			if choice == "55":
				print("   Если не работает функция [01] — Либо не может найти папку\n   databases, либо в папке нету баз данных. Обратитесь к разрабу.\n   Софт не имеет встроенных баз данных для наименьшего\n   веса файла, найти базы данных можно у разработчика.\n   Так же ошибка может быть в случае отсутствия библиотек,\n   в терминале напишите pip install (Название библиотеки)\n   Для всех функций которые начинаются на 0 нужен интернет.\n   (кроме функции [01])\n   Если после [04] сломался банер пиши 99."+ Fore.GREEN + "\n\n\n   Тг боты для деанономизации: \n   Парсер Вк https://.t.me/VKHistoryRobot\n   Узнать номер по юзернейму тг https://t.me./TgelgramProrRuBot\n   Сильный осинт по бд https:/t.me/osintorgbot\n   Глаз бога https://t.me.Ochpocmakbot\n   Куча ботов в одном боте https://t.me./UniversalSearchEasyBot\n   На Pydroid 3 кликабельно." + Fore.BLUE)
			if choice == "77":
				if setbat == 1:
					setbat = 2
					print(Fore.RED +"   Батник [01] выключен"+Fore.BLUE)
				elif setbat == 2:
						setbat = 1
						print(Fore.GREEN +"   Батник [01] включен" + Fore.BLUE)
			if choice == "66":
				open_file("gpt")
				clear()
			if choice == "2":
				open_file("os")
			if choice == "02":
				open_file("os")
			if choice == "01":
				if setbat == 1:
					open_file("bdo")
				elif setbat == 2:
					open_file("bdos")
			if choice == "1":
				if setbat == 1:
					open_file("bdo")
				elif setbat == 2:
					open_file("bdos")
			if choice == "06":
				open_file("anonmail")
			if choice == "6":
				open_file("anonmail")
			if choice == "5":
				open_file("phone")
			if choice == "05":
				open_file("phone")
			if choice == "04":
				open_file("vk")	
			if choice == "4":
				open_file("vk")	
			if choice == "03":
				open_file("search_ip")
			if choice == "3":
				open_file("search_ip")